{
  "King eider": "Description \nThe king eider is a large sea duck, measuring 50–70 cm (20–28 in) in length with a wingspan of 86–102 cm (34–40 in). Males are, on average, heavier than females, with a mean weight of 1.668 kg (3.68 lb) for males and 1.567 kg (3.45 lb) for females. An individual bird's mass can vary considerably from season to season—from as little as 0.9 kg (2.0 lb) to as much as 2.2 kg (4.9 lb). Like all eiders, the species is sexually dimorphic; the male is slightly larger and, in breeding plumage, much more colourful than the female. The male is unmistakable with its mostly black body, buff-tinged white breast and multicoloured head. The head, nape and neck are a pale bluish grey. The cheek is pale green. The bill, separated from the face by a thin black line, is red with a white nail and a large, distinctive yellow knob. Some tertials are curved up and form \"spurs\" along the back.\nThe female (occasionally colloquially referred to as a \"queen eider\") is a warm brown colour overall, slightly paler on the head and neck. The feathers on her upperparts and flanks are marked with blackish chevrons, while those on her neck and head bear fine black streaks. She has a buffy spot at the base of her bill and a buffy eye ring which extends into a downward curving stripe behind her eye. Her bill is variously described as black or grey, and her legs and feet are greenish grey.\nJuvenile birds are greyish brown. Late in their first autumn, young males moult into a darker plumage, with white on the breast and rump; it takes them three years to achieve full adult plumage.",
  "Common Loon": "Description \nThe adult common loon can range from 66 to 91 cm (26 to 36 in) in length with a 127 to 147 cm (4 ft 2 in to 4 ft 10 in) wingspan, slightly smaller than the similar yellow-billed loon. On average, it is about 81 cm (32 in) long and has a wingspan of 136 cm (54 in). Its weight can vary anywhere from 2.2 to 7.6 kg (4.9 to 16.8 lb). Sizes vary regionally, especially by body mass, with the smallest bodied loons on average from lower-central Canada and the Great Lakes, while westerly birds are similar or mildly larger, and loons breeding further east can appear to be significantly larger. Furthermore, males average up to nearly 27% more massive than females in some populations. Breeding loons in Maine averaged 4.65 kg (10.3 lb) in females and 5.97 kg (13.2 lb) in males, essentially the same weight as the yellow-billed loon, although the yellow-billed is still larger than in linear dimensions (especially bill length) than the Maine loons. In Ontario, 20 females averaged 4.5 kg (9.9 lb) and 20 males averaged 5.46 kg (12.0 lb). In contrast, in the Gulf of Alaska, adults of both sexes reportedly averaged 4.13 kg (9.1 lb). Adult breeding plumage consists of a broad black head and neck with greenish, purplish, or bluish sheen. It has a black bill sometimes with a pale tip, and red eyes. The neck is encircled with a characteristic black ring and has two white necklaces of eight to ten short streaks on the upper foreneck, and a noticeable collar of white, parallel lines forming a large oval on the neck-side. The central lower foreneck is pure white, and the lower neck-sides has longitudinal white lines becoming rows of small spots and black lines becoming very narrow. The upperparts are blackish or blackish grey, and each feather has small white spots on it. The upperwing is blackish and with small white spots on the non-primary coverts, whereas the underwing is paler with white coverts except the long black shaft-streaks on the axillaries. The underparts are pure white, but have some black on the undertail coverts and vent. It has a checkered black-and-white mantle and a blackish tail. The legs are pale grey on the inner half and blackish on the outer half, and the webs between the toes are flesh colored.\n\nAdult non-breeding plumage is brownish with a dark neck and head marked with dark grey-brown. The eyes are surrounded with white, and the eyelids are pale. The bill is mostly pale grey, with a dark culmen and tip, but in early spring the tip may turn whitish. The underparts, lower face, chin, and throat are also whitish. The foreneck is whitish, usually forming wedge-shaped notch in dark neck-sides, and may sometimes reveal a shadowy trace of the neck ring or a pale collar. It has dark brownish grey upperparts with an unclear pattern of squares on the shoulders and some wing coverts spotted with white, which are usually concealed while swimming. The male and the female have similar appearances, although they exhibit sexual dimorphism in their physical dimensions with the male larger and significantly heavier than the female.\nThe heavy dagger-like bill is evenly tapered and greyish, sometimes having a black tip. The bill colour and angle distinguish this species from the yellow-billed loon. The neck is short and thick. The common loon swims very low in the water, with sometimes only its head held above and horizontal to the surface. It must run across the water surface to get in flight. During flight, its head is slightly lower than its body, with its feet trailing behind. It has a skeletal structure made up of a number of solid bones (this is usual for the Gaviiformes and penguins but unlike most flying birds which have bones with extensive pneumatization, hollow and filled with air to make the skeleton lighter), which adds weight but helps in diving.\n\nA juvenile often has a dark, brownish-grey nape that may look darker than the pale-edged black feathers. It has a dark grey to black head, neck, and upperparts, with white throat, cheeks, and underparts. During the first winter, the bill shape of the young may not be as fully developed as that of the adult, and during the second winter, it much resembles the breeding adult, but with wing coverts lacking white spots.\nThe common loon is distinguished from the black-throated loon (G. arctica) and the red-throated loon (G. stellata) mainly by its larger size. It usually has a steeper forehead and a bulging forecrown, somewhat similar to the black-throated loon. Its bill is heavier and the back is paler than its hindneck. It is more difficult to separate from the yellow-billed loon, but its breeding plumage has more white markings on the neck and the squares on its shoulders are usually smaller; the non-breeding plumage has darker neck-sides contrasting more sharply with pale areas and bill colour.",
  "Western Screech Owl": "Description \nLength averages 22 cm (8.7 in), wingspan 55 cm (22 in), and weight 143 g (5.0 oz). Weight ranges from 88 to 220 g (3.1 to 7.8 oz). Females are larger than males and northern populations are notably larger than southern populations. Adults are larger than whiskered screech owls, with larger feet and a more streaked plumage pattern.\nThere are several morphs: brown Pacific, grey Pacific, Great Plains, Mojave, and Mexican. All have either brown or dark gray plumage with streaking on the underparts. There is no red morph. This brown and gray streaky coloring allows the owl to camouflage with trees and hide from predators.\nThey have a round head with ear tufts, yellow eyes, and a yellowish bill. Their appearance is quite similar to whiskered and eastern screech owls, so it is best to identify them by their calls. They were previously considered to be the same species as the eastern screech owl.",
  "American Goldfinch": "Description \n\nThe American goldfinch is a small finch, 11–14 cm (4.3–5.5 in) long, with a wingspan of 19–22 cm (7.5–8.7 in). It weighs between 11–20 g (0.39–0.71 oz). Among standard measurements, the wing chord is 6.5 to 7.8 cm (2.6 to 3.1 in), the tail is 4.2 to 5.1 cm (1.7 to 2.0 in), the culmen is 0.9 to 1.1 cm (0.35 to 0.43 in) and the tarsus is 1.2 to 1.4 cm (0.47 to 0.55 in). The beak is small, conical, and pink for most of the year, but turns bright orange with the spring molt in both sexes.\nThe shape and size of the beak aid in the extraction of seeds from the seed heads of thistles, sunflowers, and other plants.\nThe American goldfinch undergoes a molt in the spring and autumn. It is the only cardueline finch to undergo molting twice a year. During the winter molt it sheds all its feathers; in the spring, it sheds all but the wing and tail feathers, which are dark brown in the female and black in the male. The markings on these feathers remain through each molt, with bars on the wings and white under and at the edges of the short, notched tail. The sexual dimorphism displayed in plumage coloration is especially pronounced after the spring molt, when the bright color of the male's summer plumage is needed to attract a mate.\nOnce the spring molt is complete, the body of the male is a brilliant lemon yellow, a color produced by carotenoid pigments from plant materials in its diet, with a striking jet black cap and white rump that is visible during flight. The female is mostly brown, lighter on the underside with a yellow bib. After the autumn molt, the bright summer feathers are replaced by duller plumage, becoming buff below and olive-brown above, with a pale yellow face and bib. The autumn plumage is almost identical in both sexes, but the male has yellow shoulder patches.\nThe immature bird has a dull brown back, and the underside is pale yellow. The shoulders and tail are a dull black with buff-colored, rather than white, markings on wings and rump. This coloration is the same in both sexes.\nThe song is a series of musical warbles and twitters, often with a long note. A tsee-tsi-tsi-tsit call is often given in flight; it may also be described as per-chic-o-ree. While the female incubates the eggs, she calls to her returning mate with a soft continuous tee-tee-tee-tee-tee sound. The young begin to use a call of chick-kee or chick-wee shortly before fledging, which they use until they have left the nest entirely. There are two defense calls made by adults during nesting; a sweet call made to rally other goldfinches to the nest and distract predators, and a bearbee used to signal to the nestlings to quiet them and get them to crouch down in the nest to become less conspicuous.",
  "Northern Pygmy Owl": "Description \n\nAdults are 15–17 cm (5.9–6.7 in) in overall length and are gray, brownish-gray or rufous in colour.   This owl has a round white-spotted head, weakly defined facial disc, and dark upper breast, wings and tail, the latter quite long compared to other owls.  The eyes are yellow and the bill is yellowish-green.  The bird has two black nape spots outlined in white on the back of its head, which look like eyes.  The mid to lower breast is white with darker vertical streaking.  Legs are feathered down to the four well-armed toes on each foot.",
  "Rufous hummingbird": "Description \n\nThe adult male has a white breast, rufous face, flanks and tail and an iridescent orange-red throat patch or gorget. Some males have some green on their back and/or crown. The female has green, white, and some iridescent orange feathers in the center of the throat, and a dark tail with white tips and rufous base.\nThe female is slightly larger than the male. Females and the rare green-backed males are extremely difficult to differentiate from Allen's hummingbird. The typical \"notched\" shape of the second rectrix (R2) is considered an important field mark to distinguish the adult male rufous hummingbird from the adult male Allen's hummingbird. This is a typical-sized hummingbird, being a very small bird. It weighs 2–5 g (1⁄16–3⁄16 oz), measures 7–9 cm (3–3+1⁄2 in) long and spans 11 cm (4+1⁄2 in) across the wings.",
  "Common Raven": "Description \n\nA mature common raven ranges between 54 and 71 cm (21 and 28 in) and has a wingspan of 116 to 153 cm (46 to 60 in). Recorded weights range from 0.69 to 2.250 kg (1.52 to 4.96 lb), thus making the common raven one of the heaviest passerines. Birds from colder regions such as the Himalayas and Greenland are generally larger with slightly larger bills, while those from warmer regions are smaller with proportionally smaller bills. Representative of the size variation in the species, ravens from California weighed an average of 0.784 kg (1.73 lb), those from Alaska weighed an average of 1.135 kg (2.50 lb) and those from Nova Scotia weighed an average of 1.230 kg (2.71 lb). The bill is large and slightly curved, with a culmen length of 5.7 to 8.5 cm (2.2 to 3.3 in), one of the largest bills amongst passerines (only the thick-billed raven and white-necked raven have larger bills). It has a longish, strongly graduated tail, at 20 to 26.3 cm (7.9 to 10.4 in), and mostly iridescent black plumage, and a dark brown iris. The throat feathers are elongated and pointed and the bases of the neck feathers are pale brownish-grey. The legs and feet are stout and strong, with a tarsus length of 6 to 7.2 cm (2.4 to 2.8 in). The juvenile plumage is similar but duller, with a blue-grey iris, and pinkish gape at first.\nApart from its greater size, the common raven differs from related crows by having a larger and heavier black beak, shaggy feathers around the throat, longer bristles above the beak, and a longer, wedge-shaped tail. Flying ravens are distinguished from crows by their tail shape, larger wing area, and more stable soaring style, which generally involves less wing flapping. Despite their bulk, ravens are easily as agile in flight as their smaller cousins. In flight the feathers produce a creaking sound that has been likened to the rustle of silk. The voice of ravens is also quite distinct, its usual call being a deep croak of a much more sonorous quality than a crow's call, though the calls of other ravens like the fan-tailed raven and brown-necked raven can be confused where they occur together with common ravens in parts of southwest Asia and northern Africa; of these two, the fan-tailed raven is more similar in calls but has a very different shape with its broad wings and very short tail, while the brown-necked raven can be very hard to distinguish on plumage, but has somewhat more crow-like calls. In North America, the Chihuahuan raven (C. cryptoleucus) is fairly similar to the relatively small common ravens of the American southwest and is best distinguished by the still relatively smaller size of its bill, beard and body and relatively longer tail. The all-black carrion crow (C. corone) and rook (C. frugilegus) in Europe may suggest a raven due to their largish bill but are still distinctly smaller and have the wing and tail shapes typical of crows.\n\nIn the Faroe Islands, a now-extinct pied colour morph of this species existed, known as the pied raven; the ordinary black-coloured common ravens remain widespread in the archipelago. White ravens are occasionally found in the wild. Some in British Columbia lacked the pink eyes of an albino, and were instead leucistic, a condition where an animal lacks any of several different types of pigment, not simply melanin.\n\nCommon ravens have a wide range of vocalizations which are of interest to ornithologists. Gwinner carried out important studies in the early 1960s, recording and photographing his findings in great detail. Fifteen to 30 categories of calls have been recorded for this species, most of which are used for social interaction. Calls recorded include alarm calls, chase calls, and flight calls. The species has a distinctive, deep, resonant prruk-prruk-prruk call, which to experienced listeners is unlike that of any other corvid. Its very wide and complex vocabulary includes a high, knocking toc-toc-toc, a dry, grating kraa, a low guttural rattle and some calls of an almost musical nature.\nLike other corvids, the common raven can mimic sounds from their environment, including human speech. Non-vocal sounds produced by the common raven include wing whistles and bill snapping. Clapping or clicking has been observed more often in females than in males. If a member of a pair is lost, its mate reproduces the calls of its lost partner to encourage its return.",
  "Savannah Sparrow": "Description \nThe Savannah sparrow has a typically sparrow-like dark-streaked brown back, and whitish underparts with brown or blackish breast and flank streaking. It has whitish crown and supercilium stripes, sometimes with some yellow (more often near the beak). The cheeks are brown and the throat white. The flight feathers are blackish-brown with light brown or white border. The eyes are dark. The feet and legs are horn-colored, as is the lower part of the bill, with the upper part being dark grey.\nIt is a very variable species, with numerous subspecies, several of which have been split as separate species at various times. The different forms vary principally in the darkness of the plumage. The variation generally follows Gloger's rule, with Alaskan and interior races the palest, and southwestern coastal forms the darkest. There are some exceptions, though, most conspicuously in some island populations that presumably were strongly affected by founder effects. The general pattern of variation has a fairly clear divide, southwest of which the birds become notably darker; this agrees quite well with the limit between P. sandwichensis and P. (s.) rostratus. Savannah sparrows show some variation in size across subspecies. The total length can range from 11 to 17 cm (4.3 to 6.7 in), wingspan ranges from 18 to 25 cm (7.1 to 9.8 in) and body mass from 15 to 29 g (0.53 to 1.02 oz). In the nominate subspecies, the body weight averages 20.1 g (0.71 oz).\nThe Savannah sparrows proper (see below) are very similar, and migrant birds can not usually be related to a breeding population with certainty. The resident or partially migratory subspecies are well distinguishable by size and, particularly between groups, coloration."
}