{
  "King eider": "Description \nThe king eider is a large sea duck, measuring 50–70 cm (20–28 in) in length with a wingspan of 86–102 cm (34–40 in). Males are, on average, heavier than females, with a mean weight of 1.668 kg (3.68 lb) for males and 1.567 kg (3.45 lb) for females. An individual bird's mass can vary considerably from season to season—from as little as 0.9 kg (2.0 lb) to as much as 2.2 kg (4.9 lb). Like all eiders, the species is sexually dimorphic; the male is slightly larger and, in breeding plumage, much more colourful than the female. The male is unmistakable with its mostly black body, buff-tinged white breast and multicoloured head. The head, nape and neck are a pale bluish grey. The cheek is pale green. The bill, separated from the face by a thin black line, is red with a white nail and a large, distinctive yellow knob. Some tertials are curved up and form \"spurs\" along the back.\nThe female (occasionally colloquially referred to as a \"queen eider\") is a warm brown colour overall, slightly paler on the head and neck. The feathers on her upperparts and flanks are marked with blackish chevrons, while those on her neck and head bear fine black streaks. She has a buffy spot at the base of her bill and a buffy eye ring which extends into a downward curving stripe behind her eye. Her bill is variously described as black or grey, and her legs and feet are greenish grey.\nJuvenile birds are greyish brown. Late in their first autumn, young males moult into a darker plumage, with white on the breast and rump; it takes them three years to achieve full adult plumage.",
  "Common Loon": "Description \nThe adult common loon can range from 66 to 91 cm (26 to 36 in) in length with a 127 to 147 cm (4 ft 2 in to 4 ft 10 in) wingspan, slightly smaller than the similar yellow-billed loon. On average, it is about 81 cm (32 in) long and has a wingspan of 136 cm (54 in). Its weight can vary anywhere from 2.2 to 7.6 kg (4.9 to 16.8 lb). Sizes vary regionally, especially by body mass, with the smallest bodied loons on average from lower-central Canada and the Great Lakes, while westerly birds are similar or mildly larger, and loons breeding further east can appear to be significantly larger. Furthermore, males average up to nearly 27% more massive than females in some populations. Breeding loons in Maine averaged 4.65 kg (10.3 lb) in females and 5.97 kg (13.2 lb) in males, essentially the same weight as the yellow-billed loon, although the yellow-billed is still larger than in linear dimensions (especially bill length) than the Maine loons. In Ontario, 20 females averaged 4.5 kg (9.9 lb) and 20 males averaged 5.46 kg (12.0 lb). In contrast, in the Gulf of Alaska, adults of both sexes reportedly averaged 4.13 kg (9.1 lb). Adult breeding plumage consists of a broad black head and neck with greenish, purplish, or bluish sheen. It has a black bill sometimes with a pale tip, and red eyes. The neck is encircled with a characteristic black ring and has two white necklaces of eight to ten short streaks on the upper foreneck, and a noticeable collar of white, parallel lines forming a large oval on the neck-side. The central lower foreneck is pure white, and the lower neck-sides has longitudinal white lines becoming rows of small spots and black lines becoming very narrow. The upperparts are blackish or blackish grey, and each feather has small white spots on it. The upperwing is blackish and with small white spots on the non-primary coverts, whereas the underwing is paler with white coverts except the long black shaft-streaks on the axillaries. The underparts are pure white, but have some black on the undertail coverts and vent. It has a checkered black-and-white mantle and a blackish tail. The legs are pale grey on the inner half and blackish on the outer half, and the webs between the toes are flesh colored.\n\nAdult non-breeding plumage is brownish with a dark neck and head marked with dark grey-brown. The eyes are surrounded with white, and the eyelids are pale. The bill is mostly pale grey, with a dark culmen and tip, but in early spring the tip may turn whitish. The underparts, lower face, chin, and throat are also whitish. The foreneck is whitish, usually forming wedge-shaped notch in dark neck-sides, and may sometimes reveal a shadowy trace of the neck ring or a pale collar. It has dark brownish grey upperparts with an unclear pattern of squares on the shoulders and some wing coverts spotted with white, which are usually concealed while swimming. The male and the female have similar appearances, although they exhibit sexual dimorphism in their physical dimensions with the male larger and significantly heavier than the female.\nThe heavy dagger-like bill is evenly tapered and greyish, sometimes having a black tip. The bill colour and angle distinguish this species from the yellow-billed loon. The neck is short and thick. The common loon swims very low in the water, with sometimes only its head held above and horizontal to the surface. It must run across the water surface to get in flight. During flight, its head is slightly lower than its body, with its feet trailing behind. It has a skeletal structure made up of a number of solid bones (this is usual for the Gaviiformes and penguins but unlike most flying birds which have bones with extensive pneumatization, hollow and filled with air to make the skeleton lighter), which adds weight but helps in diving.\n\nA juvenile often has a dark, brownish-grey nape that may look darker than the pale-edged black feathers. It has a dark grey to black head, neck, and upperparts, with white throat, cheeks, and underparts. During the first winter, the bill shape of the young may not be as fully developed as that of the adult, and during the second winter, it much resembles the breeding adult, but with wing coverts lacking white spots.\nThe common loon is distinguished from the black-throated loon (G. arctica) and the red-throated loon (G. stellata) mainly by its larger size. It usually has a steeper forehead and a bulging forecrown, somewhat similar to the black-throated loon. Its bill is heavier and the back is paler than its hindneck. It is more difficult to separate from the yellow-billed loon, but its breeding plumage has more white markings on the neck and the squares on its shoulders are usually smaller; the non-breeding plumage has darker neck-sides contrasting more sharply with pale areas and bill colour.",
  "Western Screech Owl": "Description \nLength averages 22 cm (8.7 in), wingspan 55 cm (22 in), and weight 143 g (5.0 oz). Weight ranges from 88 to 220 g (3.1 to 7.8 oz). Females are larger than males and northern populations are notably larger than southern populations. Adults are larger than whiskered screech owls, with larger feet and a more streaked plumage pattern.\nThere are several morphs: brown Pacific, grey Pacific, Great Plains, Mojave, and Mexican. All have either brown or dark gray plumage with streaking on the underparts. There is no red morph. This brown and gray streaky coloring allows the owl to camouflage with trees and hide from predators.\nThey have a round head with ear tufts, yellow eyes, and a yellowish bill. Their appearance is quite similar to whiskered and eastern screech owls, so it is best to identify them by their calls. They were previously considered to be the same species as the eastern screech owl.",
  "American Goldfinch": "Description \n\nThe American goldfinch is a small finch, 11–14 cm (4.3–5.5 in) long, with a wingspan of 19–22 cm (7.5–8.7 in). It weighs between 11–20 g (0.39–0.71 oz). Among standard measurements, the wing chord is 6.5 to 7.8 cm (2.6 to 3.1 in), the tail is 4.2 to 5.1 cm (1.7 to 2.0 in), the culmen is 0.9 to 1.1 cm (0.35 to 0.43 in) and the tarsus is 1.2 to 1.4 cm (0.47 to 0.55 in). The beak is small, conical, and pink for most of the year, but turns bright orange with the spring molt in both sexes.\nThe shape and size of the beak aid in the extraction of seeds from the seed heads of thistles, sunflowers, and other plants.\nThe American goldfinch undergoes a molt in the spring and autumn. It is the only cardueline finch to undergo molting twice a year. During the winter molt it sheds all its feathers; in the spring, it sheds all but the wing and tail feathers, which are dark brown in the female and black in the male. The markings on these feathers remain through each molt, with bars on the wings and white under and at the edges of the short, notched tail. The sexual dimorphism displayed in plumage coloration is especially pronounced after the spring molt, when the bright color of the male's summer plumage is needed to attract a mate.\nOnce the spring molt is complete, the body of the male is a brilliant lemon yellow, a color produced by carotenoid pigments from plant materials in its diet, with a striking jet black cap and white rump that is visible during flight. The female is mostly brown, lighter on the underside with a yellow bib. After the autumn molt, the bright summer feathers are replaced by duller plumage, becoming buff below and olive-brown above, with a pale yellow face and bib. The autumn plumage is almost identical in both sexes, but the male has yellow shoulder patches.\nThe immature bird has a dull brown back, and the underside is pale yellow. The shoulders and tail are a dull black with buff-colored, rather than white, markings on wings and rump. This coloration is the same in both sexes.\nThe song is a series of musical warbles and twitters, often with a long note. A tsee-tsi-tsi-tsit call is often given in flight; it may also be described as per-chic-o-ree. While the female incubates the eggs, she calls to her returning mate with a soft continuous tee-tee-tee-tee-tee sound. The young begin to use a call of chick-kee or chick-wee shortly before fledging, which they use until they have left the nest entirely. There are two defense calls made by adults during nesting; a sweet call made to rally other goldfinches to the nest and distract predators, and a bearbee used to signal to the nestlings to quiet them and get them to crouch down in the nest to become less conspicuous.",
  "Northern Pygmy Owl": "Description \n\nAdults are 15–17 cm (5.9–6.7 in) in overall length and are gray, brownish-gray or rufous in colour.   This owl has a round white-spotted head, weakly defined facial disc, and dark upper breast, wings and tail, the latter quite long compared to other owls.  The eyes are yellow and the bill is yellowish-green.  The bird has two black nape spots outlined in white on the back of its head, which look like eyes.  The mid to lower breast is white with darker vertical streaking.  Legs are feathered down to the four well-armed toes on each foot.",
  "Rufous hummingbird": "Description \n\nThe adult male has a white breast, rufous face, flanks and tail and an iridescent orange-red throat patch or gorget. Some males have some green on their back and/or crown. The female has green, white, and some iridescent orange feathers in the center of the throat, and a dark tail with white tips and rufous base.\nThe female is slightly larger than the male. Females and the rare green-backed males are extremely difficult to differentiate from Allen's hummingbird. The typical \"notched\" shape of the second rectrix (R2) is considered an important field mark to distinguish the adult male rufous hummingbird from the adult male Allen's hummingbird. This is a typical-sized hummingbird, being a very small bird. It weighs 2–5 g (1⁄16–3⁄16 oz), measures 7–9 cm (3–3+1⁄2 in) long and spans 11 cm (4+1⁄2 in) across the wings.",
  "Common Raven": "Description \n\nA mature common raven ranges between 54 and 71 cm (21 and 28 in) and has a wingspan of 116 to 153 cm (46 to 60 in). Recorded weights range from 0.69 to 2.250 kg (1.52 to 4.96 lb), thus making the common raven one of the heaviest passerines. Birds from colder regions such as the Himalayas and Greenland are generally larger with slightly larger bills, while those from warmer regions are smaller with proportionally smaller bills. Representative of the size variation in the species, ravens from California weighed an average of 0.784 kg (1.73 lb), those from Alaska weighed an average of 1.135 kg (2.50 lb) and those from Nova Scotia weighed an average of 1.230 kg (2.71 lb). The bill is large and slightly curved, with a culmen length of 5.7 to 8.5 cm (2.2 to 3.3 in), one of the largest bills amongst passerines (only the thick-billed raven and white-necked raven have larger bills). It has a longish, strongly graduated tail, at 20 to 26.3 cm (7.9 to 10.4 in), and mostly iridescent black plumage, and a dark brown iris. The throat feathers are elongated and pointed and the bases of the neck feathers are pale brownish-grey. The legs and feet are stout and strong, with a tarsus length of 6 to 7.2 cm (2.4 to 2.8 in). The juvenile plumage is similar but duller, with a blue-grey iris, and pinkish gape at first.\nApart from its greater size, the common raven differs from related crows by having a larger and heavier black beak, shaggy feathers around the throat, longer bristles above the beak, and a longer, wedge-shaped tail. Flying ravens are distinguished from crows by their tail shape, larger wing area, and more stable soaring style, which generally involves less wing flapping. Despite their bulk, ravens are easily as agile in flight as their smaller cousins. In flight the feathers produce a creaking sound that has been likened to the rustle of silk. The voice of ravens is also quite distinct, its usual call being a deep croak of a much more sonorous quality than a crow's call, though the calls of other ravens like the fan-tailed raven and brown-necked raven can be confused where they occur together with common ravens in parts of southwest Asia and northern Africa; of these two, the fan-tailed raven is more similar in calls but has a very different shape with its broad wings and very short tail, while the brown-necked raven can be very hard to distinguish on plumage, but has somewhat more crow-like calls. In North America, the Chihuahuan raven (C. cryptoleucus) is fairly similar to the relatively small common ravens of the American southwest and is best distinguished by the still relatively smaller size of its bill, beard and body and relatively longer tail. The all-black carrion crow (C. corone) and rook (C. frugilegus) in Europe may suggest a raven due to their largish bill but are still distinctly smaller and have the wing and tail shapes typical of crows.\n\nIn the Faroe Islands, a now-extinct pied colour morph of this species existed, known as the pied raven; the ordinary black-coloured common ravens remain widespread in the archipelago. White ravens are occasionally found in the wild. Some in British Columbia lacked the pink eyes of an albino, and were instead leucistic, a condition where an animal lacks any of several different types of pigment, not simply melanin.\n\nCommon ravens have a wide range of vocalizations which are of interest to ornithologists. Gwinner carried out important studies in the early 1960s, recording and photographing his findings in great detail. Fifteen to 30 categories of calls have been recorded for this species, most of which are used for social interaction. Calls recorded include alarm calls, chase calls, and flight calls. The species has a distinctive, deep, resonant prruk-prruk-prruk call, which to experienced listeners is unlike that of any other corvid. Its very wide and complex vocabulary includes a high, knocking toc-toc-toc, a dry, grating kraa, a low guttural rattle and some calls of an almost musical nature.\nLike other corvids, the common raven can mimic sounds from their environment, including human speech. Non-vocal sounds produced by the common raven include wing whistles and bill snapping. Clapping or clicking has been observed more often in females than in males. If a member of a pair is lost, its mate reproduces the calls of its lost partner to encourage its return.",
  "Savannah Sparrow": "Description \nThe Savannah sparrow has a typically sparrow-like dark-streaked brown back, and whitish underparts with brown or blackish breast and flank streaking. It has whitish crown and supercilium stripes, sometimes with some yellow (more often near the beak). The cheeks are brown and the throat white. The flight feathers are blackish-brown with light brown or white border. The eyes are dark. The feet and legs are horn-colored, as is the lower part of the bill, with the upper part being dark grey.\nIt is a very variable species, with numerous subspecies, several of which have been split as separate species at various times. The different forms vary principally in the darkness of the plumage. The variation generally follows Gloger's rule, with Alaskan and interior races the palest, and southwestern coastal forms the darkest. There are some exceptions, though, most conspicuously in some island populations that presumably were strongly affected by founder effects. The general pattern of variation has a fairly clear divide, southwest of which the birds become notably darker; this agrees quite well with the limit between P. sandwichensis and P. (s.) rostratus. Savannah sparrows show some variation in size across subspecies. The total length can range from 11 to 17 cm (4.3 to 6.7 in), wingspan ranges from 18 to 25 cm (7.1 to 9.8 in) and body mass from 15 to 29 g (0.53 to 1.02 oz). In the nominate subspecies, the body weight averages 20.1 g (0.71 oz).\nThe Savannah sparrows proper (see below) are very similar, and migrant birds can not usually be related to a breeding population with certainty. The resident or partially migratory subspecies are well distinguishable by size and, particularly between groups, coloration.",
  "Eastern Bluebird": "Description \nEastern bluebirds measure 16–21 cm (6.3–8.3 in) long, span 25–32 cm (9.8–12.6 in) across the wings, and weigh 27–34 g (0.95–1.20 oz).\nMale bluebirds have a bright head, back, and wings. Their breast is a brownish red. Females are lighter with gray on the head and back and some blue on their wings and tail. In females, the breast is usually lighter in color than in males, and is more orange.",
  "Harris's Hawk": "Description \n\nThis medium-large hawk is roughly intermediate in size between a peregrine falcon (Falco peregrinus) and a red-tailed hawk (Buteo jamaicensis). Harris's hawks range in length from 46 to 59 cm (18 to 23 in) and generally have a wingspan of about 103 to 120 cm (41 to 47 in). These hawks have a brownish plumage, reddish shoulders, and tail feathers with a white base and white tip.\nThey exhibit sexual dimorphism with the females being larger by about 35%. In the United States, the average weight for adult males is about 701 g (1.545 lb), with a range of 546 to 850 g (1.204 to 1.874 lb), while the adult female average is 1,029 g (2.269 lb), with a range of 766 to 1,633 g (1.689 to 3.600 lb). They have dark brown plumage with chestnut shoulders, wing linings, and thighs, white on the base and tip of the tail, long, yellow legs, and a yellow cere. The vocalizations of Harris's hawk are very harsh sounds.\nThe lifespan of Harris's hawk is 10–12 years in the wild, though up to 25 years has been recorded in captivity.",
  "Coopers Hawk": "Description \n\nCooper's hawk is a medium-sized hawk and relatively large for an Astur. Compared to related species, they tend to have moderate-length wings, a long, often graduated or even wedge-shaped tail and long though moderately thick legs and toes. Their eyes tend to be set well forward in the sides of the relatively large and squarish-looking head (though the head can look somewhat rounded if the feathers on the nape are held flush) and a relatively short but robust bill. They have hooked bills that are well-adapted for tearing the flesh of prey, as is typical of raptorial birds. \nGenerally, Cooper's hawks can be considered secretive, often perching within the canopy, but can use more open perches, especially in the western part of the range or in winter when they may use leafless or isolated trees, utility poles or exposed stumps. On perched hawks, the wing-tips tend to appear to cover less than one third of the tail, sometimes seeming to barely cover the covert feathers.\nAs adults, they may be a solid blue-gray or brown-gray color above. Adults usually have a well-defined crown of blackish-brown feathers above a paler nape and hindneck offset against their streaked rufous cheeks. Their tail is blue-gray on top and pale underneath, barred with three black bands in a rather even pattern and ending in a rather conspicuous white tip. The adult's underside shows a bit of whitish base color overlaid heavily with coarse, irregular rufous to cinnamon bands, though these narrow into marginal shaft streaks around the throat. Against the rich color on the rest of the underside, the pure white crissum on adults is conspicuous. Adult females may average slightly more brownish or grayish above, while some adult males can range rarely into almost a powder blue color. \nAlthough little regional variation is known in the plumage, adult coloring in the Pacific Northwest averages slightly darker overall. Aberrant pale plumage was recorded in at least four total birds of both sexes, all of which were almost completely white and lacked any underside streaking. These birds had faded back color and lacking strong barring on the tail. An aberrant dark female was also recorded. As a juvenile, she had a blackish-brown (rather than mid-brown) back and dark inky feathers below with grayish ground color barely showing. Later she produced an aberrant male with similar characteristics that successfully fledged. The latter two were possible cases of melanism and such dark variations are virtually unprecedented in any Accipiter species.\nJuveniles of the species are generally dark brown above, though the feathers are not infrequently edged with rufous to cinnamon and have a variable whitish mottling about the back, wing coverts and, mainly, the scapulars. Juvenile Cooper's tend to have streaking or washing of tawny on the cheeks, ending in a light nuchal strip, giving them a hooded appearance unlike the capped appearance of adults (some juveniles, unlike adults, may manifest a slim supercilium as well). The crown is brown on juveniles rather than blackish as in adults. The tail is similar to that of the adult but more brownish and sometimes shows an additional fourth band. The juvenile has more pale white to cream base color showing than older birds, with variable dusky throat striping and mid-brown streaks, which appear as sharply defined from about the lower throat to the lower breast. The juvenile may have brown to black spots or bars on the thighs with thin black streaks mostly ending at the belly and conspicuous white crissum and undertail coverts. Juveniles can tend to appear more \"disheveled\" and less compact than adults in feather composition. \nIn flight, though usually considered medium-sized, Cooper's hawks can appear fairly small. This effect is emphasized by the short wings relative to the elongated tail (unlike unrelated hawks, the wingspan is usually less than twice as broad as the total length). The species tends to have rounded wings, a long rounded tail and long legs, much like other Accipiters. Cooper's hawks have a strong flight with stiff beats and short glides, tending to do so on quite level wings with wrist thrust forward yet the head consistently projects. The 5 outer functional primaries are notched on their inner webs, the outermost is the longest, the next outermost nearly as long. When soaring, these hawks do so on flattish or, more commonly, slightly raised wings, with fairly straight leading edges. Against the barred underbody on adults, the wings are more or less flecked in similar color, with pale greyish flight feathers and a broadly white-tipped tail correspondingly barred with dark gray. Meanwhile, the upperside of adults is essentially all blue-grey. Juvenile are mostly dark above though manifest a hooded effect on the head and a rufous-buff edges and especially whitish mottling, the latter can be fairly apparent. Juveniles are mainly whitish below with neatly dark streaks about the wing linings, breast, flanks and thighs, with bars on the axillaries and flight feathers. The tail of the juvenile has a broadly white tip and bars like adults but the ground color is a paler shade of gray.\n\nAdults have eyes ranging from light orange to red, with males averaging darker in eye color, while those of juveniles are yellow. Among 370 breeding hawks from different parts of the range, 1-year-old males usually had light orange eyes and 1-year-old females usually yellow eyes. Meanwhile, males of 2 or more years old always had consistently darker eyes than the eyes of females of the same relative age, with most males of the age having largely either orange (40.4%) or dark orange (32.3%) eyes, while female eyes at this stage were light orange or lighter. From the second year, the eyes of Cooper's hawks may grow darker still but stop darkening shortly thereafter. 3-year or older males were found to have predominantly dark orange (37.3% vs 21.6% of similar age females), red (34.6% vs 3.3% of similar age females) or mid-orange (26.6% vs 55% of similar age females). For unclear reasons, far more adults in British Columbia and North Dakota (83% of males, 63% of females) had dark orange or red eyes (which also manifested at an earlier age in British Columbia) than mature hawks in Wisconsin (49% of males, 14% of females). Most females over 2 years old in Wisconsin were found to have light orange eyes. The purpose of bright eye color in the hawks may be correlated to feeding stimulation of nestling hawks (i.e. darker orange or red objects may be more perceptible and tend to be pecked at more so than duller colors). The eyes of this hawk, as in most predatory birds, face forward, enabling good depth perception for hunting and catching prey while flying at top speeds. Adults have greenish yellow ceres and have legs of orangish to yellow while these parts on juveniles are a paler hue, yellow-green to yellow. \nThe prebasic molt begins in late April–May and takes about 4 months. The female usually begins to molt about 7–10 days sooner than the male. Molts occur inward towards the body on the wing feathers. Tail molt may generally start with the middle tail feathers, proceeding posteriorly to the upper tail coverts, also starting with the median feathers on the scapulars. Up to 36% of juvenile feathers may be retained in the second pre-basic molt. Arrested molt has been recorded in the late nesting period, often pausing after the third primary is molted. Molts tend to be halted especially when food supplies are down during the brooding stage, and may be resumed after the stress of feeding the brooding diminishes.",
  "Cassowary": "Description \n\nTypically, all cassowaries are shy birds that are found in the deep forest. They are adept at disappearing long before a human knows they are there. The southern cassowary of the far north Queensland rain forests is not well studied, and the northern and dwarf cassowaries even less so. Females are larger and more brightly coloured than the males. Adult southern cassowaries are 1.5 to 1.8 m (4 ft 11 in to 5 ft 11 in) tall, although some females may reach 2 m (6 ft 6+1⁄2 in), and weigh 58.5 kg (130 lb). However, it is not uncommon to see exceptionally large females topping the scales beyond 70 kg (150 lb), with the largest maximum recorded being a southern cassowary at 85 kg (187 lb) and 190 cm (6 ft 3 in) tall. \nHence, by technicality, all three species of cassowaries are considered as Asia's largest bird since the extinction of the Arabian ostrich. Moreover, not only is the cassowary Asia's largest bird, within New Guinea, the cassowary is the island's second largest terrestrial animal after the introduction of Cervidaes such as the rusa deer, chital, and fallow deer.\nAll cassowaries' feathers consist of a shaft and loose barbules. They do not have rectrices (tail feathers) or a preen gland. Cassowaries have small wings with five or six large remiges. These are reduced to stiff, keratinous quills, resembling porcupine quills, with no barbs. The furcula and coracoid are degenerate, and their palatal bones and sphenoid bones touch each other. These, along with their wedge-shaped body, are thought to be adaptations to ward off vines, thorns, and saw-edged leaves, allowing them to run quickly through the rainforest.\nUnlike the majority of birds, cassowaries lack a tongue. Their beaks are pointed, sharp and robust but not serrated, which allows them to pick up fruit more easily than the short bills of an emu or an ostrich.\nCassowaries have three-toed feet with sharp claws. The inner (first) toe has a dagger-like claw that may be 125 mm (5 in) long. This claw is particularly fearsome, since cassowaries sometimes kick humans and other animals with their powerful legs. Cassowaries can run at up to 50 km/h (30 mph) through the dense forest and can jump up to 1.5 m (4 ft 11 in). They are good swimmers, crossing wide rivers and swimming in the sea.\nAll three species have a keratinous, skin-covered casque on their heads that grows with age. The casque's shape and size, up to 18 cm (7 in), is species-dependent. C. casuarius has the largest and C. bennetti the smallest (tricorn shape), with C. unappendiculatus having variations in between. Contrary to earlier findings, the hollow inside of the casque is spanned with fine fibres.\n\nSeveral functions for the casque have been proposed. One is that they are a secondary sexual characteristic. Other suggested functions include batting through the underbrush, as a weapon in dominance disputes, or pushing aside leaf litter during foraging. The latter three are disputed by biologist Andrew Mack, whose personal observation suggests that the casque amplifies deep sounds. This is related to a discovery that at least the dwarf cassowary and southern cassowary produce very low-frequency sounds, which may aid in communication in dense rainforests. The \"boom\" vocalization that cassowaries produce is the lowest-frequency bird call known and is at the lower limit of human hearing. Recent study suggests that casque acts as a thermal radiator, offloading heat at high temperatures and restricting heat loss at low temperatures.\nThe average lifespan of wild cassowaries is approximately 18–20 years, with those held in captivity living up to 40 years.",
  "Southern Cassowary": "Description \n\nThe southern cassowary has stiff, bristly black plumage, a blue face and a long neck, red on the cape and two red wattles measuring around 17.8 cm (7.0 in) in length hanging down around its throat. A horn-like brown casque, measuring 13 to 16.9 cm (5.1 to 6.7 in) high, sits atop the head. The bill can range from 9.8 to 19 cm (3.9 to 7.5 in). The plumage is sexually monomorphic, but the female is dominant and larger with a longer casque, larger bill and brighter-coloured bare parts. The juveniles have brown longitudinal striped plumage. \nThe three-toed feet are thick and powerful, equipped with a lethal dagger-like claw up to 12 cm (4.7 in) on the inner toe. It is perhaps the largest member of the cassowary family and is tied as the third heaviest bird on earth (after the Somali ostrich and the common ostrich), at a maximum size estimated at 85 kg (187 lb) and 190 cm (6 ft 3 in) tall. Normally, this species ranges from 127 to 170 cm (4 ft 2 in to 5 ft 7 in) in length. The height is normally 150 to 180 cm (4 ft 11 in to 5 ft 11 in) ; females average 58.5 kg (129 lb), while males average 29 to 34 kg (64–75 lb). The northern cassowary is about the same size on average and is perhaps very mildly less sexually dimorphic than the southern. Most adult birds will weigh between 17 and 70 kg (37 and 154 lb). It is technically the largest Asian bird (since the extinction of the Arabian ostrich) and the largest Australian bird (though the emu may be slightly taller)."
}